###################################################################

# Created by write_sdc on Fri Feb 27 13:57:10 2026

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_transition 0.5 [current_design]
set_max_fanout 8 [current_design]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[7]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[6]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[5]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[4]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[3]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[2]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[1]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {a[0]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[7]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[6]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[5]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[4]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[3]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[2]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[1]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {b[0]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {opcode[2]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {opcode[1]}]
set_driving_cell -lib_cell INVD1 -pin ZN [get_ports {opcode[0]}]
set_load -pin_load 0.05 [get_ports {result[7]}]
set_load -pin_load 0.05 [get_ports {result[6]}]
set_load -pin_load 0.05 [get_ports {result[5]}]
set_load -pin_load 0.05 [get_ports {result[4]}]
set_load -pin_load 0.05 [get_ports {result[3]}]
set_load -pin_load 0.05 [get_ports {result[2]}]
set_load -pin_load 0.05 [get_ports {result[1]}]
set_load -pin_load 0.05 [get_ports {result[0]}]
set_load -pin_load 0.05 [get_ports carry_out]
set_load -pin_load 0.05 [get_ports zero]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_uncertainty -setup 0.1  [get_clocks clk]
set_clock_uncertainty -hold 0.05  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports {a[7]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[7]}]
set_input_delay -clock clk  -max 1  [get_ports {a[6]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[6]}]
set_input_delay -clock clk  -max 1  [get_ports {a[5]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[5]}]
set_input_delay -clock clk  -max 1  [get_ports {a[4]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[4]}]
set_input_delay -clock clk  -max 1  [get_ports {a[3]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[3]}]
set_input_delay -clock clk  -max 1  [get_ports {a[2]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[2]}]
set_input_delay -clock clk  -max 1  [get_ports {a[1]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[1]}]
set_input_delay -clock clk  -max 1  [get_ports {a[0]}]
set_input_delay -clock clk  -min 0.2  [get_ports {a[0]}]
set_input_delay -clock clk  -max 1  [get_ports {b[7]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[7]}]
set_input_delay -clock clk  -max 1  [get_ports {b[6]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[6]}]
set_input_delay -clock clk  -max 1  [get_ports {b[5]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[5]}]
set_input_delay -clock clk  -max 1  [get_ports {b[4]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[4]}]
set_input_delay -clock clk  -max 1  [get_ports {b[3]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[3]}]
set_input_delay -clock clk  -max 1  [get_ports {b[2]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[2]}]
set_input_delay -clock clk  -max 1  [get_ports {b[1]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[1]}]
set_input_delay -clock clk  -max 1  [get_ports {b[0]}]
set_input_delay -clock clk  -min 0.2  [get_ports {b[0]}]
set_input_delay -clock clk  -max 1  [get_ports {opcode[2]}]
set_input_delay -clock clk  -min 0.2  [get_ports {opcode[2]}]
set_input_delay -clock clk  -max 1  [get_ports {opcode[1]}]
set_input_delay -clock clk  -min 0.2  [get_ports {opcode[1]}]
set_input_delay -clock clk  -max 1  [get_ports {opcode[0]}]
set_input_delay -clock clk  -min 0.2  [get_ports {opcode[0]}]
set_input_delay -clock clk  -max 0.2  [get_ports rst_n]
set_input_delay -clock clk  -min 0  [get_ports rst_n]
set_output_delay -clock clk  -max 1  [get_ports {result[7]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[7]}]
set_output_delay -clock clk  -max 1  [get_ports {result[6]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[6]}]
set_output_delay -clock clk  -max 1  [get_ports {result[5]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[5]}]
set_output_delay -clock clk  -max 1  [get_ports {result[4]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[4]}]
set_output_delay -clock clk  -max 1  [get_ports {result[3]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[3]}]
set_output_delay -clock clk  -max 1  [get_ports {result[2]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[2]}]
set_output_delay -clock clk  -max 1  [get_ports {result[1]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[1]}]
set_output_delay -clock clk  -max 1  [get_ports {result[0]}]
set_output_delay -clock clk  -min 0.2  [get_ports {result[0]}]
set_output_delay -clock clk  -max 1  [get_ports carry_out]
set_output_delay -clock clk  -min 0.2  [get_ports carry_out]
set_output_delay -clock clk  -max 1  [get_ports zero]
set_output_delay -clock clk  -min 0.2  [get_ports zero]
