###################################################################

# Created by write_sdc on Fri Feb 27 00:37:51 2026

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 8 [current_design]
set_max_transition 0.5 [current_design]
set_load -pin_load 0.05 [get_ports {sum[3]}]
set_load -pin_load 0.05 [get_ports {sum[2]}]
set_load -pin_load 0.05 [get_ports {sum[1]}]
set_load -pin_load 0.05 [get_ports {sum[0]}]
set_load -pin_load 0.05 [get_ports cout]
create_clock -name vclk  -period 10  -waveform {0 5}
set_max_delay 5  -from [list [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports cin]]  -to [list [get_ports {sum[3]}] [get_ports {sum[2]}] [get_ports {sum[1]}] [get_ports {sum[0]}] [get_ports cout]]
set_input_delay -clock vclk  -max 2  [get_ports {a[3]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {a[3]}]
set_input_delay -clock vclk  -max 2  [get_ports {a[2]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {a[2]}]
set_input_delay -clock vclk  -max 2  [get_ports {a[1]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {a[1]}]
set_input_delay -clock vclk  -max 2  [get_ports {a[0]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {a[0]}]
set_input_delay -clock vclk  -max 2  [get_ports {b[3]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {b[3]}]
set_input_delay -clock vclk  -max 2  [get_ports {b[2]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {b[2]}]
set_input_delay -clock vclk  -max 2  [get_ports {b[1]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {b[1]}]
set_input_delay -clock vclk  -max 2  [get_ports {b[0]}]
set_input_delay -clock vclk  -min 0.5  [get_ports {b[0]}]
set_input_delay -clock vclk  -max 2  [get_ports cin]
set_input_delay -clock vclk  -min 0.5  [get_ports cin]
set_output_delay -clock vclk  -max 2  [get_ports {sum[3]}]
set_output_delay -clock vclk  -min 0.5  [get_ports {sum[3]}]
set_output_delay -clock vclk  -max 2  [get_ports {sum[2]}]
set_output_delay -clock vclk  -min 0.5  [get_ports {sum[2]}]
set_output_delay -clock vclk  -max 2  [get_ports {sum[1]}]
set_output_delay -clock vclk  -min 0.5  [get_ports {sum[1]}]
set_output_delay -clock vclk  -max 2  [get_ports {sum[0]}]
set_output_delay -clock vclk  -min 0.5  [get_ports {sum[0]}]
set_output_delay -clock vclk  -max 2  [get_ports cout]
set_output_delay -clock vclk  -min 0.5  [get_ports cout]
set_input_transition -max 0.5  [get_ports {a[3]}]
set_input_transition -max 0.5  [get_ports {a[2]}]
set_input_transition -max 0.5  [get_ports {a[1]}]
set_input_transition -max 0.5  [get_ports {a[0]}]
set_input_transition -max 0.5  [get_ports {b[3]}]
set_input_transition -max 0.5  [get_ports {b[2]}]
set_input_transition -max 0.5  [get_ports {b[1]}]
set_input_transition -max 0.5  [get_ports {b[0]}]
set_input_transition -max 0.5  [get_ports cin]
